y_connector/y_5ml-per-minute_4cm/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Copied from https://www.openfoam.com/documentation/guides/latest/doc/guide-case-system-controldict.html
// Still needs to be adapted for our y-connector

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.8;

deltaT          0.00025;

writeControl    timeStep;

writeInterval   400;

purgeWrite      10;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

// adjustTimeStep  false;

runTimeModifiable true;

functions
{
    // Function objects
    #includeFunc residuals
}

// ************************************************************************* //
